Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AnalyticalModelSurface,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new hosted area load within the project.
aDoc:
Document to which new area load will be added.
host:
The analytical surface host element (Analytical Floor, Analytical Foundation Slab or Analytical Wall) for the area Load.
forceVector:
The force vector applied to the 1st reference point of the area load.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016